package ru.murtazin.homeworks.homework11.task16;

/**
 * ДЗ (16)
 * Дана строка, реализовать метод который ищет слово с наибольшим количеством букв.
 * Если таких слов несколько - вывести последнее *
 */


public class StringUtilsBiggestWord {
    public static String getLargest(String input) {
// TODO

        return "";
    }

    private StringUtilsBiggestWord() {

    }

    public static void main(String[] args) {
        System.out.println("При вводе строки \"самое большое слово\" метод должен вернуть \"большое\" - "
                + StringUtilsBiggestWord.getLargest("самое большое слово"));
    }
}
