package ru.murtazin.homeworks.homework14.task35;

/**
 * ДЗ (35)
 * Реализуйте метод, который заменяет все нулевые биты переданного числа на 1 и
 * возвращает получившееся десятичное число.
 */
public class FunctionUtilsShiftZeroes {
    public static int shiftZeroes(int input) {
// TODO
        return 0;
    }
    private FunctionUtilsShiftZeroes() {

    }

    public static void main(String[] args) {
        System.out.println(
                "При вводе числа 3435, метод должен вернуть 4095 - '"
                        + FunctionUtilsShiftZeroes.shiftZeroes(3435)
                        + "'"
        );
    }
}
